content/posts/aoc2023-day04.en.md
+++
title = "Advent of code 2023 - Day 4: Scratchcards"
author = ["Alex Seltmann"]
date = 2023-12-19T00:25:00+01:00
lastmod = 2023-12-31T01:15:28+01:00
tags = ["python"]
draft = false
creator = "Emacs 29.1 (Org mode 9.7 + ox-hugo)"
+++

This year I try to record my attempt at solving the **Advent of Code 2023**
riddles. This is Day 4 - see <https:adventofcode.com/2023/day/4>


## Part 1 {#part-1}

Lets first read the task:

> The Elf leads you over to the pile of colorful cards. There, you discover dozens
> of scratchcards, all with their opaque covering already scratched off. Picking
> one up, it looks like each card has two lists of numbers separated by a vertical
> bar (`|`): a list of **winning numbers** and then a list of **numbers you have**.
> You organize the information into a table (your puzzle input).
>
> As far as the Elf has been able to figure out, you have to figure out which of
> the **numbers you have** appear in the list of **winning numbers**. The first match
> makes the card worth **one point** and each match after the first **doubles** the
> point value of that card.
>
> For example:

```text
Card 1: 41 48 83 86 17 | 83 86  6 31 17  9 48 53
Card 2: 13 32 20 16 61 | 61 30 68 82 17 32 24 19
Card 3:  1 21 53 59 44 | 69 82 63 72 16 21 14  1
Card 4: 41 92 73 84 69 | 59 84 76 51 58  5 54 83
Card 5: 87 83 26 28 32 | 88 30 70 12 93 22 82 36
Card 6: 31 18 13 56 72 | 74 77 10 23 35 67 36 11
```

> In the above example, card 1 has five winning numbers (`41`, `48`, `83`, `86`,
> and `17`) and eight numbers you have (`83`, `86`, `6`, `31`, `17`, `9`, `48`,
> and `53`). Of the numbers you have, four of them (`48`, `83`, `17`, and `86`)
> are winning numbers! That means card 1 is worth `8` points (1 for the first
> match, then doubled three times for each of the three matches after the first).
>
> -   Card 2 has two winning numbers (`32` and `61`), so it is worth `2` points.
> -   Card 3 has two winning numbers (`1` and `21`), so it is worth `2` points.
> -   Card 4 has one winning number (`84`), so it is worth `1` point.
> -   Card 5 has no winning numbers, so it is worth no points.
> -   Card 6 has no winning numbers, so it is worth no points.
>
> So, in this example, the Elf's pile of scratchcards is worth `13` points.
>
> Take a seat in the large pile of colorful cards. **How many points are they worth
> in total?**

Loading this data is very similar to **Day 2** - so let's load the data as we did
there. Our goal is to get `win` and `yours` columns holding the respective
digits which we want to compare. We find the numbers with one or more digits
using the regex `\d+`. And we want them to be in **sets** (not lists), as we can
logically compare sets in Python.

```python
import pandas as pd
import re

txt = pd.read_table('data/2023-12-04-1-aoc.txt', names=['win'])
txt['id'] = txt.loc[:, 'win'].str.split(':').apply(
    lambda x: int(x[0].strip('Card ')))
txt['win'] = (txt.loc[:, 'win']
              .str.split(':').apply(lambda x: x[1]))
txt['yours'] = (txt.loc[:, 'win']
                .str.split('|')
                .apply(lambda x: x[1])
                # get a list of only the numbers / digits
                .apply(lambda x: re.findall(r'\d+', x))
                # convert the list of strings to a set of integers
                .apply(lambda x: set([int(i) for i in x])))
txt['win'] = (txt.loc[:, 'win']
              .str.split('|')
              .apply(lambda x: x[0])
              .apply(lambda x: re.findall(r'\d+', x))
              .apply(lambda x: set([int(i) for i in x])))

txt
```

Now, we get the [logical conjunction](https://en.wikipedia.org/wiki/Logical_conjunction) of `win` and `yours`, these are our winning
numbers. Then, the number of wins is converted to points - for all number of
wins bigger than 1, we can get the points by `2**(n_wins-1)`.

```python
txt['n_wins'] = txt.apply(
    lambda row: len(row.loc['win'] & row.loc['yours']), axis=1)
txt['points'] = txt.loc[:, 'n_wins'].apply(
    lambda x: 2**(x-1) if x > 1 else x)

txt.loc[:, ['win', 'n_wins', 'points']]
```

Then, we just sum up:

<details>
<summary>Reveal solution!</summary>
<div class="details">

```python
  sum(txt.loc[:, 'points'])
```

```text
25004
```
</div>
</details>


## Part 2 {#part-2}

> There's no such thing as "points". Instead, scratchcards only cause you to **win
> more scratchcards** equal to the number of winning numbers you have.
>
> Specifically, you win **copies** of the scratchcards below the winning card equal to
> the number of matches. So, if card 10 were to have 5 matching numbers, you would
> win one copy each of cards 11, 12, 13, 14, and 15.
>
> Copies of scratchcards are scored like normal scratchcards and have the **same
> card number** as the card they copied. So, if you win a copy of card 10 and it
> has 5 matching numbers, it would then win a copy of the same cards that the
> original card 10 won: cards 11, 12, 13, 14, and 15. This process repeats until
> none of the copies cause you to win any more cards. (Cards will never make you
> copy a card past the end of the table.)
>
> This time, the above example goes differently:

```text
Card 1: 41 48 83 86 17 | 83 86  6 31 17  9 48 53
Card 2: 13 32 20 16 61 | 61 30 68 82 17 32 24 19
Card 3:  1 21 53 59 44 | 69 82 63 72 16 21 14  1
Card 4: 41 92 73 84 69 | 59 84 76 51 58  5 54 83
Card 5: 87 83 26 28 32 | 88 30 70 12 93 22 82 36
Card 6: 31 18 13 56 72 | 74 77 10 23 35 67 36 11
```

> -   Card 1 has four matching numbers, so you win one copy each of the next four
>     cards: cards 2, 3, 4, and 5.
> -   Your original card 2 has two matching numbers, so you win one copy each of
>     cards 3 and 4.
> -   Your copy of card 2 also wins one copy each of cards 3 and 4.
> -   Your four instances of card 3 (one original and three copies) have two
>     matching numbers, so you win **four** copies each of cards 4 and 5.
> -   Your eight instances of card 4 (one original and seven copies) have one
>     matching number, so you win **eight** copies of card 5.
> -   Your fourteen instances of card 5 (one original and thirteen copies) have no
>     matching numbers and win no more cards.
>
> Once all of the originals and copies have been processed, you end up with `1`
> instance of card 1, `2` instances of card 2, `4` instances of card 3, `8`
> instances of card 4, `14` instances of card 5, and `1` instance of card 6. In
> total, this example pile of scratchcards causes you to ultimately have `30`
> scratchcards!
>
> Process all of the original and copied scratchcards until no more scratchcards
> are won. Including the original set of scratchcards, **how many total scratchcards
> do you end up with?**

We will use the  `n_wins` column we created before and go from there. We step
through each Game. Each **current game** gets +1 card. Then, we step through the
number of **next games** depending on our `n_wins`. Each of these gets added the
card number of the **current game**.

```python
txt['cards'] = 0

for i, nwin in enumerate(txt.loc[:, 'n_wins']):
    txt.loc[i, 'cards'] += 1
    for j in range(1, nwin+1):
        txt.loc[i+j, 'cards'] += txt.loc[i, 'cards']

txt.loc[:, ['n_wins', 'cards']]
```

Now, we just sum the output again:

<details>
<summary>Reveal solution!</summary>
<div class="details">

```python
  sum(txt['cards'])
```

```text
14427616
```
</div>
</details>
